Tekla Open API Reference for Tekla Structures 2025
AnalysisAreaPolygon.Edges Property
 The edges of the area polygon.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisEdge> Edges { get; set; }
Public Property Edges As List(Of AnalysisEdge)
	Get
	Set
Property Value
Type: List<AnalysisEdge>
See Also
Reference
AnalysisAreaPolygon Class
Tekla.Structures.Analysis Namespace